



/*
 * SHARED STRINGS
 */

/*
 * ./PACUtils.swift
 */

"PAC has been updated by latest GFW List." = "已经使用最新的 GFW List 更新PAC";

"It's failed to update PAC by User Rules." = "更新 PAC 失败";

"Failed to download latest GFW List." = "下载最新的 GFW 列表失败";

/*
 * ./AppDelegate.swift
 */

"Save Diagnosis to File" = "保存诊断信息到文件";

"Global Mode" = "全局模式";

"Manual Mode" = "手动模式";

"Auto Mode By PAC" = "PAC自动模式";

"Add \(addCount) Shadowsocks Server Profile" = "已添加\(addCount)个Shadowsocks服务器配置";

"Not found valid qrcode or url of shadowsocks profile" = "没有找到有效的shadowsocks配置二维码或链接";

"By scan QR Code" = "通过扫描二维码";

"Shadowsocks: On" = "Shadowsocks: On";

"Turn Shadowsocks Off" = "关闭 Shadowsocks";

"Shadowsocks: Off" = "Shadowsocks: Off";

"Turn Shadowsocks On" = "打开 Shadowsocks";

"Servers" = "服务器";

"Servers - (No Selected)" = "服务器 - (未选择)";

"Add \(addCount) Shadowsocks Server Profile" = "新增 \(addCount) 个 Shadowsocks 服务器配置";

"Not found valid QRCode of shadowsocks profile" = "未找到有效的 shadowsocks 二维码";

"Not found valid URL of shadowsocks profile" = "未找到有效的 shadowsocks 链接";

/*
 * ./HTTPPreferencesWindowController.swift
 */

"Export Command Copied." = "Export 命令已复制至剪贴板";

"Timeout" = "超时";

/*
 * ./ShadowsocksX-NG/ShareServerProfilesWindowController.swift
 */

"Save All Server URLs To File" = "保存所有服务器 URL 到文件";

"Save QRCode As File" = "保存 QRCode 为文件";

/*
 * ./ShadowsocksX-NG/ImportWindowController.swift
 */

"Success to add \(addCount) server." = "成功添加 \(addCount) 个服务器";

"Not found valid shadowsocks server urls." = "未找到有效的shadowsocks服务器URL";

/*
 * ./ShadowsocksX-NG/PreferencesWindowController.swift
 */

"New Server" = "新建服务器";

/*
* ./ShadowsocksX-NG/TenonMainWindowsController.swift
*/

"Smarte Route" = "智能路由";
"Tenon p2p protecting your IP and privacy." = "Tenon p2p 网络正在保护你的IP和隐私";
"SETTINGS" = "账号设置";
"UPGRADE" = "升级更新";
"Already the latest version." = "已经是最新版本。";
"There is an updated version, in order to ensure that your network is smooth, download the latest version." = "有更新版本，为了保证你的网络畅通，下载最新版本。";
"ACCOUNT SETTING" = "账号设置";
"Private Key" = "安全私钥";
"Account Address" = "账号地址";
"Balance" = "账户余额";
"Transactions" = "交易记录";
"waiting server" = "等待数据...";


"Agent service is not supported in your country or region." = "所在国家或地区不支持代理服务";
"Free 100M/day used up, buy tenon or use tomorrow." = "今天免费 100M 流量已经用完，购买套餐或者明天继续使用。";
"Free 100M/day" = "";
"Connect p2p vpn network failed." = "连接P2P网络失败!";
"Your account is logged in elsewhere." = "你的账号在其他地方登陆.";
"VIP " = "";
"days" = " 天后到期";
"after success reset private key, must restart program." = "账号设置完成后裔，需要重启程序";
"copy sharing link succeeded." = "拷贝分享链接成功";
"Decentralized VPN, safe, reliable and high speed." = "去中心化VPN，安全可靠高速。";

"Share"="分享";
"Settings"="设置";
"Third Node Join"="加入节点";
"Third-party node access, one-click startup, and access to the decentralized Tenon VPN network to provide services and routing"="第三方节点接入，一键式启动，并接入去中心化Tenon VPN网络，提供服务和路由";
"Language"="选择语言";
"proxy pattern"="代理模式";
"smart_route"="智能路由";
"global_route"="全局代理";
"TG"="TG群";
"Email"="邮箱";
"Upgrade"="更新版本";
"Cancel"="取消";
"Skip Ads"="";
"Failed to initialize P2P network, please try again!"="初始化P2P网络失败，请重试！";
"Withdraw"="提币";
"private_key_notices"="提示：为了保障安全，请保存好您的私钥，不要告诉任何人，确保您的账户安全";
"Destination Tenon Address"="提现流量Tenon地址";
"Type or paste address"="输入或粘贴地址";
"Count"="数量";
"Allow to seel"="可提";
"Minimum Count 100"="最低数量100";
"Seel out all"="全部提取";
"Tip: At least 100 Tenon can be mentioned. For security, please keep your private key and don't tell anyone to ensure your account is safe."="提示：最少可提100 Tenon。为了保障安全，请保存好您的私钥，不要告诉任何人，确保您的账户安全。";
"History"="历史记录";
"Expired"="已过期";
"Earn"="赚币";
"To VPN"="VIP消耗";
"tTrans Out"="转出";
"Tran In"="转入";
"Share Reward"="分享奖励";
"Ad Reward"="广告奖励";
"ad_reward_info"="广告获得奖励：3~10 个币";
"Ad is not ready."="广告还未准备好，请重试.";
"exit_and_retry"="可能网络没有初始化完成，重试或退出APP重试.";
"Transfer to your account"="转账到你的地址";
"Way 1"="方式1";
"Way 2"="方式2";
"Way 3"="方式3";
"MWay 4"="方式4";
"Way 5"="方式5";
"Method seven"="方式6";
"Buy"="购买";
"Join"="加入";
"Buy Success"="购买成功";
"your phone cannot IAP"="您的手机不支持内购";
"no product"="暂无商品";
"order failed"="交易失败";
"Click modify settings"="点击修改设置";
"MONTHLY                    $5"      ="包月    5   美元";
"QUARTERLY                  $12 / -20%"="包季    12 美元 / 8折";
"ANNUAL           $36 / -40%"  ="包年    36美元 / 6折";
"Share to earn"   ="分享获得Tenon";
"Mining"="挖矿";
"History"="交易记录";
"time"="交易时间";
"type"="类型";
"amount"="交易额";
"Balance"="余额";
"Transfer Tenon directly to your anonymous account"="";
"Copy"="复制";
"Monthly/Quarterly/Annual"="月付/季付/年付";
"Fast"="快速";
"Watch ads to earn Tenon"="观看广告获得Tenon";
"Go"="进入";
"Copy success!"="复制成功";
"United States"="美国";
"America"="美国";
"China"="中国";
"Singapore"="新加坡";
"Japan"="日本";
"South Korea"="南韩";
"Canada"="加拿大";
"France"="法国";
"England"="英格兰";
"Germany"="德国";
"Australia"="澳大利亚";
"Brazil"="巴西";
"Netherlands"="荷兰";
"Hong Kong"="香港";
"India"="印度";
"Russia"="俄罗斯";
"Anonymous User"="匿名用户";
"Private key"="私钥";
"Free"="免费";
"Higher performance"="更高性能·更高质量";
"Disconnect"="未链接";
"Connected"="已链接";
"P2P networks are protecting your IP and data privacy"="P2P网络正在保护您的IP和数据隐私";
"Community"="社区版本";
"Professional"="专业版";
"Total"="总值";
"Enter private key"="输入私钥";
"Enter the 64-bit private key"="输入64位私钥";
"OK"="确定";
"nodes"="个节点";
"Linking for you"="正在为您链接";
"About"="产品说明  |";
"Telegram"="服务支持";
"Join the node\nThird-party node access, one-click startup, and access to the decentralized Tenon VPN network to provide services and routing\nhttps://github.com/tenondvpn/tenonvpn-join\n\nDisclaimer\nTenon VPN is composed of a large number of decentralized nodes, because there is no centralized server, thus avoiding the authority of centralization, that is, you can access the network without any blocking.\n\nTechnical Solutions\n1. Tenon VPN is composed of a large number of decentralized nodes, because there is no centralized server, thus avoiding the authority of centralization, that is, you can access the network without any blocking.\n\n2. Although Tenon VPN is decentralized, its performance is superior to a centralized VPN server because TenonVPN provides an original intelligent route that can find the best communication route through the user's current network conditions.\n\n3. Tenon VPN is decentralized. All user data is encrypted by the user's private key. At the same time , the addition of the intelligent routing network ensures the client's anonymity in the entire decentralized world.\n\n4. With a powerful P2P network and secure encryption technology, Tenvon VPN acts as a routing node through the user's home PC, making blocking impossible.\n\n5. Tenon VPN is easy to use, requires no complicated configuration, and can be safely, quickly and reliably entered into the decentralized world with one-click connection."="第三方节点加入\n一键接入Tenon去中心化网络\nhttps://github.com/tenondvpn/tenonvpn-join\n\n\n免责声明\nTenon VPN是一个完全开源的去中心化项目。\n \n技术解决方案\n1.Tenon VPN是由去中心化的大量节点组成，且代码开源，因为没有中心化的服务器，从而避免中心化的权威性，即你可以没有任何阻拦的安全的访问网络。\n \n2.Tenon VPN虽然是去中心化的，但是其性能比中心化的VPN服务器更加优越，因为TenonVPN提供独创的智能路由，可以通过用户的当前网络状况寻找最佳通信路由。\n \n3.Tenon VPN是去中心化的，所有用户数据都通过用户私钥加密，同时通过智能路由网络的加入，保证了客户端在整个去中心化世界的匿名性。\n \n4.Tenvon VPN借助强大的P2P网络和安全的加密技术，通过用户家庭PC充当路由节点，从而使封杀变得不可能。\n \n5.Tenon VPN易于使用，无需复杂的配置，一键连接即可安全，快速，可靠的进入去中心化世界。";
"Join the node"="第三方节点加入";
"Join Nodes"="加入节点";
"Disclaimer"="免责声明";
"Technical Solutions"="技术解决方案";
"About Tenon VPN"="关于 TenonVPN";
"Official website"="官网";
"invalid private key."="私钥不合法.";
"Set up to 3 private keys."="最多更换三次私钥.";
"after success reset private key, must restart program."="私钥设置成功，需要重启!";
" DAYS"=" 天后到期";
"success, now should reconnet vpn."="设置成功，请重连VPN.";
"recharge"="充值";
"paying"="上一次购买还在消费中.";
"The light of Blockchain Apps"="区块链应用之光";
"Decentralization VPN"="去中心化 VPN";
"Fast"="快速";
"Safe"="安全";
"Reliable"="可靠";
"Easy"="简单";
"OutBandwidth"="今天流量已经用完.";
"TenonOver"="Tenon不够";
"use tomorrow"="明天再用";
"success" = "成功";
"copy success" = "拷贝成功!";
"GO"="加入";
"Settings"="关于";
"Join Node"="加入节点";
"join_desc"="
第三方节点接入，一键式启动，并接入去中心化Tenon VPN网络，提供服务和路由";
"email"="邮箱";
"Site"="官网";
"TG"="TG群";
"Tips: To ensure security, please keep your private key and don’t tell anyone to ensure your account is safe"="提示：为了保障安全，请保存好您的私钥，不要告诉任何人，确保您的账户安全";
"Support"="服务支出";
